//1. Змінні та типи. Розгалуження та цикли
//https://youtu.be/m5tMeqPgb0o
//______________________________________________________________________________
// if(умова){ блок if} else{дефолтний блок фолс}
// if (4 > 5) {
//   console.log('true'); //в блок if попадає тільки тру
// } else {
//   console.log('false'); // false - попадаэмо в дефолтний блок фолс, бо умова хибна
// }

//Можемо мати декілька умов, і чекаємо перше тру, подальший пошук припиняється
// if (10 < 6) {
//   console.log('10>6');
// } else if (6 < 3) {
//   console.log('6<3');
// } else if (2 < 3) {
//   console.log('2<3'); ///перше тру, пошук припиняється
// } else {
//   console.log(false);
// }

// Якщо по умові маємо одну змінну, то вона автоматично приводиться до бульового значення
// const value = 0;
// if (value) {
//   console.log('if');
// } else {
//   console.log('block defolt');
// }
//____________________________________________________________________-
//ТЕРНАРНИЙ ВИРАЗ - є тільки два випадки- або тру або фолс
//condition? variant1: variant2
// const rezult = 3 > 1 ? 'більне' : 'меньше';

//____________________________________________________________________-
//SWITCH - концепция заключается в способности сразу палать на нужній кейс
// не перебирая все по очереди. Предназначен для number i string
// const value = 129;
// switch (value) {
//   case 130:
//     console.log(1);
//     break;
//   case 129:
//     console.log('good rezult');
//     break;
//   case 3:
//     console.log(3);
//     break;
//   default:
//     console.log('false');
// }
//____________________________________________________________________
//ОЛАСТІ ВИДИМОСТІ:
//1. Глобальна - весь файл джаваскріпта
//2. Блочна( це те що замкнено в фігурних дужках {})
//---якщо ми оголосим змінну в глобальні зоні видимості та в блочній зоні щось з нею зробити
//то ми можемо вивести  в консоль в глобальні зоні результат
//---якщо оголосимо змінну в середені блочноі моделі, то в глобальні зоні видимости
// не знайдеться зміна, вона буде існувати тільки в блочній зоні
// let d = 23;
// let value = d + 20;
// if (true) {
//   value = 70;
//   const f = 35;
// }
// console.log(value); //70 так працює
// console.log(f); // f-not defined
//exemple
// let b = 25;
// if (true) {
//   let a = 15;
//   b = 44;
//   if (true) {
//     a = 25;
//     b = 31;
//   }
//   a = 44;
//   console.log(b); //31
// }
// console.log(a); // error

//exemple 2
// let w = 32;
// if (true) {
//   w = 8;
//   let d = 10;
//   if (true) {
//     w = 90;
//     d = 4;
//   }
//   w = 1;
//   console.log(d); //4
// }
// console.log(w); //1
//__________________________________________________________________-
//Цикл for
//ініціалізація лічільника let i = 0;
//умова(до яких пір буде виконуватись цей цикл) i < 5
//на скільки на кожній іткраціі буде збільшуватись лічильник i += 1

// for (let i = 0; i < 5; i += 1) {
//   console.log(i); //0,1,2,3,4
// }

// const str = 'Hello world';
// for (let i = 0; i < str.length; i += 1) {
//   console.log(str[i]);
// }
//_____________________________________________________________
//Цикл while. Рідко використовується, якщо не вказати умову, то приведе до
//того що цикл замкне (ітерація буде відбуватися до нескінченності, поки не зависне браузер)
// щоб цього не відбулося треба вказувати умову
// let str = 'Hello world';
// let i = 0;
// while (i < str.length) {
//   console.log(str[i]);
//   i += 1;
// }
// let str = 'Hello world';
// for (i = 0; i < str.length; i += 1) {
//   if (str[i] === 'w') {
//     console.log('yes');
//     break;
//   } else {
//     console.log('no');
//   }
// }

//__________________________________________________________
//Exemple 1
//Використовуючи тип розгалудження if ..els та prompt, напишіть код ,який питатиме:
//"Яка офіційна назва JasvaScript?" Якщо користувач вводить назву ECMASrript, то
//то показуй alert з рядком ECMASrript. В штшому випадку рядок "Не знаєте! ECMASrript"
// const value = prompt('"Яка офіційна назва JasvaScript?" ');
// if (value === 'ECMASrript') {
//   alert('Правильно!');
// } else {
//   alert('Не знаєте! ECMASrript');
// }

// console.log(value);
//_______________________________________________________________________________
//Exemple 2
// Використовуємо конструкцію if ..els  для відображення рядка часу
//Напиши скрипт для відображені в консолі рядкак часу і хвилин у форматі "14 год. 29 xв."
//Якщщ minutes =0, то виводемо лише "14 год."

// const hours = 14;
// const minutes = 0;

//Варіант 1 через тернарник:
// const timestring = minutes ? `${hours} год. ${minutes} хв.` : `${hours} год. `;
// console.log(timestring);

//Варіант 2 через if ..els
// if (minutes) {
//    console.log(`${hours} год. ${minutes} хв.`);
// } else {
//   console.log(`${hours} год. `);
// }
//*** не пишемо minutes> 0, тому що вони в бульовому перетворені  і так дають тру
//

//_______________________________________________________________________________
//Exemple 3
//Напиши скрипт, який виводить у консоль "Це позитивне чило" , якщо в промпт ввели число більше 0
//Якщо користувач ввів 0, то виводим "Це  нуль"
//Якщо ввели відємне число, то виводимо "Це  відємне число"

//** Кожен етап контактування с користувачем приводить нас до рядка, а тут ми порівнюєм числа
//тому треба привести все до намбера.
//БУДЬ ЯКИЙ ІНПУТ ЗАВЖДИ ПОВЕРТАЄ РЯДОК

// const prompInput = Number(prompt('ВВедіть число!'));
// if (!prompInput) {
//   console.log('Це  нуль');
// } else if (prompInput > 0) {
//   console.log('Це позитивне чило');
// } else {
//   console.log('Це  відємне число');
// }

//_______________________________________________________________________________
//Exemple 4
//спочатку в умові перевірили на парність (prompInput % 2), а потім за допомогоюінверсіі
//привели іі до 0
// const prompInput = Number(prompt('ВВедіть число!'));
// console.log(!(prompInput % 2) ? 'парне' : 'непарне');

//_______________________________________________________________________________
//Exemple 5
// Вкладені розгалуження
// Напиши скрипт який порівнює два числа змінних a та b
//Якщо оба більше 100, то вивести у консоль максимальне з них
//В протележному випадку у консолі повина бути сума значення b та 512

// const a = 120;
// const b = 180;
//Варіант 1
// if (a > 100 && b > 100) {
//   if (a > b) {
//     console.log(a);
//   } else {
//     console.log(b);
//   }
// } else {
//   console.log(b + 512);
// }

//Варіант 2 з тернарним виразом
// if (a > 100 && b > 100) {
//   console.log(a > b ? a : b);
// } else {
//   console.log(b + 512);
// }

//_______________________________________________________________________________
//Exemple 6
// Форматування посиланя (endsWith)
//Напиши скрипт який перевіряє чи є у кінці змінноі link символ /.
//Якщо ні, то додай цей символ в кінець змінноі

//Метод endsWith() позволяет определить, заканчивается ли строка символами
// указанными в скобках, возвращая, соответственно, true или false

// якщо не має '/', то тоді додаємо

// let link = 'https://my-site.com/about';
// if (!link.endsWith('/')) {
//   console.log(link + '/');
// }

//_______________________________________________________________________________
//Exemple 7
//Напиши скрипт який перевіряє чи є у кінці змінноі link символ /.
//Якщо ні, то додай цей символ в кінець змінноі, тільки в тому випадку,
//якщо в link є підрядок "my-site"
// Варіант 1
// let link = 'https://my-site.com/about';
// if (!link.endsWith('/') && link.includes('my-site')) {
//   console.log(link + '/');
// } else {
//   console.log(link);
// }

// Варіант 2 з тернаркою
// let link = 'https://my-site.com/about';
// console.log(
//   !link.endsWith('/') && link.includes('my-site')
//     ? (link += '/')
//     : link
// ); //https://my-site.com/about/

//_______________________________________________________________________________
//Exemple 8
// if...else та логічні оператори
// Напиши скрипт, який виводить в консоль рядок в залежності від значення змінноі hours
// Якщо значення змінноі hours менше 17, виводимо рядок "Pending"
//Більше або дорівнює 17, чи  менше або дорівнює 24. Виводимо рядок"Expires"
//Більше 24, виводить рядок "Overdue"

// const houer = 22;
// if (houer < 17) {
//   console.log('Pending');
// } else if (houer >= 17 && houer <= 24) {
//   console.log('Expires');
// } else {
//   console.log('Overdue')
// };

//_______________________________________________________________________________
//Exemple 9
//Напиши скрип для відображеня здачі дедлайн проекту
//До дедлайнк проекту 0 днів , виведи рядок "Сьогодні"
//До дедлайнк проекту 1 днів , виведи рядок "Завтра"
//До дедлайнк проекту 2 днів , виведи рядок "Післязавтра"
//До дедлайнк проекту 3+ днів , виведи рядок "Дата у майбутньому"

// Варіант 1 з if....else:
// let dayUntilDedline = 2;
// if (!dayUntilDedline) {
//   console.log('Сьогодні');
// } else if (dayUntilDedline === 1) {
//   console.log('Завтра');
// } else if (dayUntilDedline === 2) {
//   console.log('Післязавтра');
// } else  {
//   console.log('Дата у майбутньому');
// }

//Варіант 2 з switch:
// let dayUntilDedline = 2;
// switch (dayUntilDedline) {
//   case 0:
//     console.log('Сьогодні');
//     break;
//   case 1:
//     console.log('Завтра');
//     break;
//   case 2:
//     console.log('Післязавтра');
//     break;
//   default:
//     console.log('Дата у майбутньому');
// }

//_______________________________________________________________________________
//Exemple 10 Цикл for
// виведи в консоль браузера числа від мін до макс, але в тому випадку, якщо
// якщо вони кратні 5
// const min = 20;
// const max = 80;
// for (let i = min; i >= min && i < max; i += 1) {
//   if (!(i % 5)) {
//     console.log(i);
//   }
// } //20,25,30.....

//_______________________________________________________________________________
//Exemple 11
//Напишши скрипт, який буде питати логін за допомогою prompt та логувати
//результат в консоль браузера:
//Якщо вілвідувач вводить "Адмін", то prompt запитує пароль
//Якщо нічого не виведено або натиснуто Esc, вивести рядок  - "Скасовано"
//В іншому випадку треба вивести рядок 'Я вас не знаю"
//Пароль перевіряти так:
//Якщо виведено пароль :  "Я Адмін", то вивести рядок "Доброго дня!"
//Інакше виводити рядок : "Невірний пароль!"

// const login = prompt('Вести логин');
// if (!login) {
//   console.log(alert('Скасовано'));
// } else if (login === 'Адмін') {
//   const password = prompt('Ввеліть пароль');
//   console.log(
//     password === 'Я адмін' ? alert('Доброго дня!') : alert('Невірний пароль!')
//   );
// } else {
//   console.log(alert('Я  вас не знаю'));
// }
